tutorials/precice/volume_coupled/fl1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/polyMesh";
    object      blockMeshDict;
}

scale 1;


zmin   0.0;
zmax  0.6;
ymin 0;
ymax 0.12;
xmin 0;
xmax  1.0;

xcells 1; 
ycells 36; 
zcells 100;

vertices
(
    ($xmax $ymin $zmin) // 0
    ($xmax $ymax $zmin) // 1
    ($xmax $ymin $zmax) // 2
    ($xmax $ymax $zmax) // 3
    ($xmin $ymin $zmin) // 0
    ($xmin $ymax $zmin) // 1
    ($xmin $ymin $zmax) // 2
    ($xmin $ymax $zmax) // 3
);

blocks
(
hex (4 0 1 5 6 2 3 7) pipe ($xcells $ycells $zcells)  edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

edges
(
);


patches
(

    patch wall
    (
        (0 4 6 2)
    )

    patch atmosphere
    (
        (1 3 7 5)
    )
    
    patch inlet
    (
        (0 1 5 4)
    )
    
    patch outlet
    (
        (3 2 6 7)
    )
);

boundaries
(
    emptyWalls
    {
        type    empty;
        faces
        (
            (0 2 3 1)
            (4 5 7 6)            
        )
    }   
);

mergePatchPairs
(
);
