tutorials/precice/volume_coupled/fl1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    wall
    {
        type            patch;
        nFaces          100;
        startFace       7064;
    }
    atmosphere
    {
        type            patch;
        nFaces          100;
        startFace       7164;
    }
    inlet
    {
        type            patch;
        nFaces          36;
        startFace       7264;
    }
    outlet
    {
        type            patch;
        nFaces          36;
        startFace       7300;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          7200;
        startFace       7336;
    }
)

// ************************************************************************* //
