tutorials/precice/volume_coupled/fl1/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";
participant Fluid1;

modules (FF);

interfaces
{
  Interface1
  {
    mesh      Fluid1-Mesh;
    patches   ();
    cellSets  (box1);
    locations volumeCenters;

    readData  (VelocityBack);
    writeData (Velocity);
  };
};

FF
{
  nameU U_vol;
};
